# YOLOv8s + Coordinate Attention + ASFF Configuration
# Improved architecture for skin lesion detection (6 classes)
#
# Changes from baseline:
#   - CoordAtt layers inserted after each C2f in backbone
#   - ASFF fusion added before detection head

# Parameters
nc: 8
scales:
  n: [0.33, 0.25, 2.0]
  s: [0.33, 0.50, 2.0]
  m: [0.67, 0.75, 1.5]
  l: [1.00, 1.00, 1.0]
  x: [1.33, 1.25, 1.0]

# Backbone with Coordinate Attention
backbone:
  - [-1, 1, Conv, [64, 3, 2]]           # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]          # 1-P2/4
  - [-1, 3, C2f, [128, True]]           # 2
  - [-1, 1, CoordAtt, [128]]            # 3  ← Coordinate Attention
  - [-1, 1, Conv, [256, 3, 2]]          # 4-P3/8
  - [-1, 6, C2f, [256, True]]           # 5
  - [-1, 1, CoordAtt, [256]]            # 6  ← Coordinate Attention
  - [-1, 1, Conv, [512, 3, 2]]          # 7-P4/16
  - [-1, 6, C2f, [512, True]]           # 8
  - [-1, 1, CoordAtt, [512]]            # 9  ← Coordinate Attention
  - [-1, 1, Conv, [1024, 3, 2]]         # 10-P5/32
  - [-1, 3, C2f, [1024, True]]          # 11
  - [-1, 1, CoordAtt, [1024]]           # 12  ← Coordinate Attention
  - [-1, 1, SPPF, [1024, 5]]            # 13

# Head with ASFF fusion (layers 15, 18, 21 are P3, P4, P5 outputs)
head:
  - [-1, 1, nn.Upsample, [None, 2, nearest]]   # 14
  - [[-1, 8], 1, Concat, [1]]                    # 15 cat backbone P4
  - [-1, 3, C2f, [512]]                           # 16

  - [-1, 1, nn.Upsample, [None, 2, nearest]]   # 17
  - [[-1, 5], 1, Concat, [1]]                    # 18 cat backbone P3
  - [-1, 3, C2f, [256]]                           # 19 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]                  # 20
  - [[-1, 16], 1, Concat, [1]]                    # 21 cat head P4
  - [-1, 3, C2f, [512]]                           # 22 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                  # 23
  - [[-1, 13], 1, Concat, [1]]                    # 24 cat head P5
  - [-1, 3, C2f, [1024]]                          # 25 (P5/32-large)

  - [[19, 22, 25], 1, ASFFHead, []]              # 26  ← ASFF fusion
  - [[26], 1, Detect, [nc]]                       # 27 Detect
