# YOLOv8s Baseline Configuration
# Standard YOLOv8s architecture for skin lesion detection (6 classes)

# Parameters
nc: 8  # number of classes
scales:
  n: [0.33, 0.25, 2.0]   # depth, width, max_channels
  s: [0.33, 0.50, 2.0]   # depth, width, max_channels
  m: [0.67, 0.75, 1.5]
  l: [1.00, 1.00, 1.0]
  x: [1.33, 1.25, 1.0]

# YOLOv8.0s backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]   # 2
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]   # 4
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]   # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]  # 8
  - [-1, 1, SPPF, [1024, 5]]    # 9

# YOLOv8.0s head
head:
  - [-1, 1, nn.Upsample, [None, 2, nearest]]  # 10
  - [[-1, 6], 1, Concat, [1]]                  # 11 cat backbone P4
  - [-1, 3, C2f, [512]]                         # 12

  - [-1, 1, nn.Upsample, [None, 2, nearest]]  # 13
  - [[-1, 4], 1, Concat, [1]]                  # 14 cat backbone P3
  - [-1, 3, C2f, [256]]                         # 15 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]                 # 16
  - [[-1, 12], 1, Concat, [1]]                  # 17 cat head P4
  - [-1, 3, C2f, [512]]                         # 18 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                 # 19
  - [[-1, 9], 1, Concat, [1]]                   # 20 cat head P5
  - [-1, 3, C2f, [1024]]                        # 21 (P5/32-large)

  - [[15, 18, 21], 1, Detect, [nc]]             # 22 Detect(P3, P4, P5)
